# St7GetSolverIncludeKG

Returns the state of the KG option for geometric nonlinear analysis.

long St7GetSolverIncludeKG(long uID, bool* IncludeKG)
Input Parameters
uID
Strand7 model file ID.
Output Parameters
IncludeKG
True if the geometric stiffness matrix, KG, is included.